#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/agent-config.yaml"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "1539" -> (known after apply)
      ~ content_md5                = "gvBq6p+5LGrhk1mrk0MGJw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Fagent-config.yaml" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/agent-config.yaml 2026-02-01 23:48:25.136290783 +0000 UTC" -> "./../os-config/infisical-config/agent-config.yaml 2026-02-02 00:00:07.816155968 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "78b036d8-7bb2-4b8b-9c4e-1bd0bcc3768a" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/freshrss.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "138" -> (known after apply)
      ~ content_md5                = "2lVZJ2WbOYM+bd/69gdCWA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Ffreshrss.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/freshrss.env.tmpl 2026-02-01 23:48:25.136290783 +0000 UTC" -> "./../os-config/infisical-config/templates/freshrss.env.tmpl 2026-02-02 00:00:07.816155968 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "e0daf617-70ce-45ab-9071-743882a7bad1" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/fulltextrss-config.php.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "606" -> (known after apply)
      ~ content_md5                = "nJGwExTlLFCnNOCEuIoq9A==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Ffulltextrss-config.php.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/fulltextrss-config.php.tmpl 2026-02-01 23:48:25.136290783 +0000 UTC" -> "./../os-config/infisical-config/templates/fulltextrss-config.php.tmpl 2026-02-02 00:00:07.816155968 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "0c216d7c-eaa3-4dbf-8f54-dfc567773b5f" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/ghcr-token.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "159" -> (known after apply)
      ~ content_md5                = "8dhlkgEsl0yAr60rjy+txA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fghcr-token.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/ghcr-token.tmpl 2026-02-01 23:48:25.136290783 +0000 UTC" -> "./../os-config/infisical-config/templates/ghcr-token.tmpl 2026-02-02 00:00:07.816155968 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "926c366c-e0ca-473c-87fb-534b47ff5d6f" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/nitter-config.conf.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "823" -> (known after apply)
      ~ content_md5                = "9Qdx22F1wRqMU4aBsI31iQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fnitter-config.conf.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/nitter-config.conf.tmpl 2026-02-01 23:48:25.136290783 +0000 UTC" -> "./../os-config/infisical-config/templates/nitter-config.conf.tmpl 2026-02-02 00:00:07.816155968 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "798c7ebb-d06c-4a21-8451-0f5134abcfc8" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/nitter-sessions.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "134" -> (known after apply)
      ~ content_md5                = "mDL4ycY76BaAptRpg0tdWg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fnitter-sessions.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/nitter-sessions.tmpl 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/infisical-config/templates/nitter-sessions.tmpl 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "4c3f98a1-2001-4640-b50d-b54282203bad" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/nitter.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "136" -> (known after apply)
      ~ content_md5                = "dqew4r9hLjCgmZM0Ent8IA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fnitter.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/nitter.env.tmpl 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/infisical-config/templates/nitter.env.tmpl 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "7810a3c6-e707-405e-8154-2b374e762a05" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/planka-postgres.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "145" -> (known after apply)
      ~ content_md5                = "UuBhrWt6vw/DS8rRmijDpw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fplanka-postgres.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/planka-postgres.env.tmpl 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/infisical-config/templates/planka-postgres.env.tmpl 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "33203dcb-cd40-4a65-87c1-0cae8ce89e47" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/planka.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "136" -> (known after apply)
      ~ content_md5                = "UoV1pgPnJd9zAa/VSjVsug==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fplanka.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/planka.env.tmpl 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/infisical-config/templates/planka.env.tmpl 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "4ac171cd-7242-4dd1-a41e-12c7e694d9e9" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/redlib.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "136" -> (known after apply)
      ~ content_md5                = "BQch5XB0PknGP/8l2GKw8w==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fredlib.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/redlib.env.tmpl 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/infisical-config/templates/redlib.env.tmpl 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "530fc86a-5730-4128-b8fa-57a7acfaa19e" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/autorestic-backup.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "824" -> (known after apply)
      ~ content_md5                = "HRhu6dPvDUR11JG6/QxYoQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Fautorestic-backup.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/autorestic-backup.container 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/quadlets/autorestic-backup.container 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "06d3ab22-2380-4dc6-8cc3-f7ae765a6862" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/autorestic-restore.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "1159" -> (known after apply)
      ~ content_md5                = "RRApOVHlX+AcJtnKwWdeYA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Fautorestic-restore.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/autorestic-restore.container 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/quadlets/autorestic-restore.container 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "1605aa7b-f78f-4ee5-9ec7-460f8e5854e5" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/infisical-agent.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "643" -> (known after apply)
      ~ content_md5                = "rbNV/YwXJEJ98Ah6innH3g==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Finfisical-agent.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/infisical-agent.container 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/quadlets/infisical-agent.container 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "d1858bf7-f550-463c-9234-1f6e96d173a5" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/traefik.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "441" -> (known after apply)
      ~ content_md5                = "liTv9S0p/ZpRNFG6/hDddQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Ftraefik.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/traefik.container 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/quadlets/traefik.container 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "d8ad1292-882d-4a31-849f-e06a13c3ffbe" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/app-backup-wrapper.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "493" -> (known after apply)
      ~ content_md5                = "zs/BL6xGQX7UB8jI5tH9Zw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fapp-backup-wrapper.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/app-backup-wrapper.service 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/systemd/app-backup-wrapper.service 2026-02-02 00:00:07.817155982 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "bbc7c8a5-f1d8-45ea-99f8-adfa42090dcc" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/app-backup.timer"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "179" -> (known after apply)
      ~ content_md5                = "fGvbbPWuCkC5I2HxzpD7cg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fapp-backup.timer" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/app-backup.timer 2026-02-01 23:48:25.137290772 +0000 UTC" -> "./../os-config/systemd/app-backup.timer 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "32437f61-e163-47c8-a24d-77560b45a285" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/app-restart@.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "119" -> (known after apply)
      ~ content_md5                = "gsf5zYqlcPhQM1f3s6ImNg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fapp-restart@.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/app-restart@.service 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/app-restart@.service 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "0ba67287-81ac-4e21-947a-ce5edc811b0c" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/freshrss.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "203" -> (known after apply)
      ~ content_md5                = "sQrUNOXfCCwmi+Y3p0VN0A==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Ffreshrss.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/freshrss.path 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/freshrss.path 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "2440b37e-262c-40c9-816f-b2279507dbed" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/freshrss.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "462" -> (known after apply)
      ~ content_md5                = "bkVxDFjaj6wDaHp3v3QCKA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Ffreshrss.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/freshrss.service 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/freshrss.service 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "b2709a49-60ca-4c1e-8e3c-87bd89dd200b" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/ghcr-login.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "333" -> (known after apply)
      ~ content_md5                = "3DoYQr7BhzU3ZJzbrUnNEw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fghcr-login.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/ghcr-login.service 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/ghcr-login.service 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "88242ca1-d64e-4078-8302-deb0b5a06e80" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/gitops-sync.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "193" -> (known after apply)
      ~ content_md5                = "rjkWfNVqAvnTLiaWl7hnJA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fgitops-sync.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/gitops-sync.service 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/gitops-sync.service 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "2f732ff8-f586-4e7c-8206-6e9f50e18d2b" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/gitops-sync.timer"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "116" -> (known after apply)
      ~ content_md5                = "AM0Wi3K0wtCLJHuxwySDRQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fgitops-sync.timer" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/gitops-sync.timer 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/gitops-sync.timer 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "43e984e4-9480-4887-a7ce-b19ebe580cbe" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/nitter.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "243" -> (known after apply)
      ~ content_md5                = "lscA8O+eZvgiXR3gP/Btgg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fnitter.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/nitter.path 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/nitter.path 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "490503d0-9517-4d86-87d1-b6598e34ec71" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/nitter.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "402" -> (known after apply)
      ~ content_md5                = "+7KApK1BrAqJvpX/B/XZiw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fnitter.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/nitter.service 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/nitter.service 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "8d7430bb-9b2c-4704-8125-52cf766826e8" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/planka.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "241" -> (known after apply)
      ~ content_md5                = "UbkGbkBS2oYM6GajhXBxMQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fplanka.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/planka.path 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/planka.path 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "55e39132-2cf2-41a4-b610-52493502c03a" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/planka.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "460" -> (known after apply)
      ~ content_md5                = "DHdycG9VHhSCZZkxKSFwgQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fplanka.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/planka.service 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/planka.service 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "96f4fdbe-da9a-47e5-a8ac-19bdeb7532e8" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/redlib.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "195" -> (known after apply)
      ~ content_md5                = "3GUaxW21h3nYYUCgZAsQJA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fredlib.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/redlib.path 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/redlib.path 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "4ad62d20-d6af-4447-bb97-c7979506e981" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/redlib.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "347" -> (known after apply)
      ~ content_md5                = "uFZzmQd+5jUQ7RUTIUeXUQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fredlib.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/redlib.service 2026-02-01 23:48:25.138290761 +0000 UTC" -> "./../os-config/systemd/redlib.service 2026-02-02 00:00:07.818155995 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "5b655f7d-f16b-42f1-99b2-862dfbebc8a8" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/traefik-config/traefik.yml"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "236" -> (known after apply)
      ~ content_md5                = "CD3FZoMyQ+KlqQKelCO21Q==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Ftraefik-config%2Ftraefik.yml" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/traefik-config/traefik.yml 2026-02-01 23:48:25.139290749 +0000 UTC" -> "./../os-config/traefik-config/traefik.yml 2026-02-02 00:00:07.819156008 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "9e934a17-5854-4212-859b-d2f81833149f" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 29 to add, 0 to change, 29 to destroy.

```